## Load the Data

In [1]:
import pandas as pd

### Data exploration - Data source 1
Print some basic information about data source 1.

In [2]:
# get data from temperature table
temp_df = pd.read_sql_table('temperature', 'sqlite:///zylesto.sqlite')
# print first 5 rows of the table
temp_df.head()

,Area Code,Area Code (M49),Area,Months Code,Months,Element Code,Element,Unit,Y1961,Y1961F,...,Y2018,Y2018F,Y2019,Y2019F,Y2020,Y2020F,Y2021,Y2021F,Y2022,Y2022F
0,2,'004,Afghanistan,7001,January,7271,Temperature change,°C,0.756,E,...,2.051,E,2.858,E,-0.681,E,0.559,E,2.284,E
1,2,'004,Afghanistan,7001,January,6078,Standard Deviation,°C,1.964,E,...,1.964,E,1.964,E,1.964,E,1.964,E,1.964,E
2,2,'004,Afghanistan,7002,February,7271,Temperature change,°C,-1.766,E,...,2.714,E,0.067,E,2.500,E,4.086,E,2.371,E
3,2,'004,Afghanistan,7002,February,6078,Standard Deviation,°C,2.602,E,...,2.602,E,2.602,E,2.602,E,2.602,E,2.602,E
4,2,'004,Afghanistan,7003,March,7271,Temperature change,°C,0.458,E,...,4.533,E,0.293,E,0.555,E,2.480,E,3.598,E

In [4]:
temp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9656 entries, 0 to 9655
Columns: 132 entries, Area Code to Y2022F
dtypes: float64(62), int64(3), object(67)
memory usage: 9.7+ MB

In [14]:
# check if data contains missing values
temp_df.isna().sum().sort_values()

Area Code             0
Area Code (M49)       0
Area                  0
Months Code           0
Months                0
                   ...
Y1965              1420
Y1964              1421
Y2001              1425
Y1977              1444
Y1991              1468
Length: 132, dtype: int64

### Data exploration - Data source 2
Print some basic information about data source 2.

In [3]:
# get data from food_price_inflation table
food_df = pd.read_sql_table('food_price_inflation', 'sqlite:///zylesto.sqlite')
# print first 5 rows of the table
food_df.head()

   Open  High   Low  Close  Inflation      country ISO3        date
0  0.53  0.54  0.53   0.53        NaN  Afghanistan  AFG  2007-01-01
1  0.53  0.54  0.53   0.53        NaN  Afghanistan  AFG  2007-02-01
2  0.54  0.54  0.53   0.53        NaN  Afghanistan  AFG  2007-03-01
3  0.53  0.55  0.53   0.55        NaN  Afghanistan  AFG  2007-04-01
4  0.56  0.57  0.56   0.57        NaN  Afghanistan  AFG  2007-05-01

In [5]:
food_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4798 entries, 0 to 4797
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       4734 non-null   float64
 1   High       4734 non-null   float64
 2   Low        4734 non-null   float64
 3   Close      4734 non-null   float64
 4   Inflation  4434 non-null   float64
 5   country    4798 non-null   object
 6   ISO3       4798 non-null   object
 7   date       4798 non-null   object
dtypes: float64(5), object(3)
memory usage: 300.0+ KB

In [15]:
# check if data contains missing values
food_df.isna().sum().sort_values()

country        0
ISO3           0
date           0
Open          64
High          64
Low           64
Close         64
Inflation    364
dtype: int64